Tekla Open API Reference for Tekla Structures 2025
IEvents.Numbering Event
 The Numbering event is raised just after a model has been numbered.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.NumberingDelegate Numbering
Event Numbering As Events.NumberingDelegate
Value
Type: Tekla.Structures.Model.Events.NumberingDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace